# Pandas

The panadas module is one of the most powerful tools for data analysis.  Pandas was designed to work with tabular and heterogeneous data.  It is standard to use the alias ``pd`` when importing pandas.
~~~
import pandas as pd
~~~
I usually import numpy at the same time since pandas and numpy are often used in tandem.

In [1]:
import numpy as np
import pandas as pd

The two main data structures that we will use from pandas are the *Series* and the *DataFrame*.

## Series
A Series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels, called the *index*.  

### Creating a Series
A Series can be created from a list, a numpy ndarray, or a dictionary using the function ``pd.Series``.

In [2]:
my_list = [45, 17, 16, 44, 28]  
labels = ['Utah', 'Ohio', 'Tennessee', 'Wyoming', 'Texas']

In [3]:
pd.Series(my_list)

0    45
1    17
2    16
3    44
4    28
dtype: int64

In [6]:
s = pd.Series(data = my_list, index = labels)

In [7]:
s

Utah         45
Ohio         17
Tennessee    16
Wyoming      44
Texas        28
dtype: int64

In [8]:
s['Ohio']

17

In [9]:
d = {'Utah':45, 'Ohio':17, 'Tennessee':16, 'Wyoming':44, 'Texas':28}

In [10]:
pd.Series(d)

Utah         45
Ohio         17
Tennessee    16
Wyoming      44
Texas        28
dtype: int64

You can kind of think about a Series as an ordered dictionary where the labels are the key and the data are the values.

The data in a Series need not be numeric

In [11]:
pd.Series(data=labels)

0         Utah
1         Ohio
2    Tennessee
3      Wyoming
4        Texas
dtype: object

## DataFrames
DataFrames are the main data structure of pandas and were directly inspired by the R programming language.  DataFrames are a bunch of Series objects put together to share the same (row) index.  A DataFrame has both a row and a column index.  

### Creating DataFrames
DataFrames can also be created from lists, dictionaries, or numpy arrays.

In [12]:
np.random.seed(229)

In [13]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [14]:
df

          W         X         Y         Z
A  0.260778 -0.440511 -1.130954  0.800912
B -0.159565  1.509733  1.475873 -1.115098
C  0.293871 -0.091970  1.494585  1.776313
D -0.284390  0.562143  0.616958 -0.962247
E  0.714923 -1.257296  0.561833  1.031310

When using dictionaries, the key will be the column name.

In [15]:
d = {'state':['Utah','Ohio','Tennessee','Wyoming','Texas'], 'order':[45,17,16,44,28], 'min_elev':[2350,455,16,44,28], 'capital':['Salt Lake City','Columbus','Nashville','Cheyenne','Autin']}

In [16]:
df2 = pd.DataFrame(d)

In [17]:
df2

       state  order  min_elev         capital
0       Utah     45      2350  Salt Lake City
1       Ohio     17       455        Columbus
2  Tennessee     16        16       Nashville
3    Wyoming     44        44        Cheyenne
4      Texas     28        28           Autin

We can turn a column of the data into the index (row name)

In [20]:
df2.index = df2['state']
del df2['state']

In [21]:
df2

           order  min_elev         capital
state
Utah          45      2350  Salt Lake City
Ohio          17       455        Columbus
Tennessee     16        16       Nashville
Wyoming       44        44        Cheyenne
Texas         28        28           Autin

## Selection and Indexing

There are various ways to get subsets of the data.  In the following ``df`` refers to a DataFrame.

#### Selecting columns
~~~
df['column_name']  # this will produce a Series
df.column_name # as long as column_name isn't a python method/attribute (also a Series)
df[['column_name']] # this will produce a DataFrame
df[['col1', 'col2', 'col3']]
~~~

#### Selecting row and columns with ``loc`` and ``iloc``
~~~
df.loc['row_name', 'col_name'] 
df.iloc['row index', 'col index']
~~~

``loc`` and ``iloc`` also support slicing.  Note: when slicing with ``loc``, the end point IS including (but not when slicing with ``iloc``.

~~~
df.loc['row_name1':'row_name2', 'col_name1':'col_name2'] #row_name2 and col_name2 WILL be included
df.loc[:, 'col_name1':'col_name2']
df.loc['r1':'r2', :]
df.loc[['r1','r2','r3'],['c1','c2]] # can also pass lists of index and column names

df.iloc[index1:index2, col1:col2] #index2 and col2 will NOT be included
~~~

#### Selecting rows based on column condition
~~~
df[df[boolean condition]]
~~~

In [22]:
df

          W         X         Y         Z
A  0.260778 -0.440511 -1.130954  0.800912
B -0.159565  1.509733  1.475873 -1.115098
C  0.293871 -0.091970  1.494585  1.776313
D -0.284390  0.562143  0.616958 -0.962247
E  0.714923 -1.257296  0.561833  1.031310

In [33]:
df.loc['A':'C','Y':'Z']

          Y         Z
A -1.130954  0.800912
B  1.475873 -1.115098
C  1.494585  1.776313

In [28]:
df.W

A    0.260778
B   -0.159565
C    0.293871
D   -0.284390
E    0.714923
Name: W, dtype: float64

In [ ]:
df

In [ ]:
df.loc['B':'D', 'X':'Z']

In [ ]:
df.iloc[1:3, 1:3]

In [ ]:
df.loc[:,['W','X','Z']]

Select columns X, Y, and Z where values in W are greater than 0.

## Methods for computing summary and descriptive statistics
pandas objects have many reduction / summary statistics methods that extract a single value from the rows or columms of a DataFrame.  See Table 5-8 in *Python for Data Analysis* for a more complete list, but here are a few that are commonly used.

`count`: number of non-NA values   
`describe`: summary statistics for numerical columns   
`min`, `max`: min and max values  
`argmin`, `argmax`: index of min and max values ## I'm not sure if this works anymore!?   
`idxmin`, `idxmax`: index or column name of min and max values  
`sum`: sum of values  
`mean`: mean of values  
`quantile`: quantile from 0 to 1 of values  
`var`: (sample) variance of values  
`std`: (sample) standard deviation of values  

Most of these functions also take an `axis` argument which specifies whether to reduce over rows or columns: 0 for rows and 1 for columns.   
There is also an argument `skipna` which specifies whether or not to skip missing values.  The default is True.

In [35]:
df.max(axis=1)

A    0.800912
B    1.509733
C    1.776313
D    0.616958
E    1.031310
dtype: float64

In [ ]:
df.idxmax()

In [ ]:
df.quantile(.5)

### Correlation and covariance
`df.corr()` and `df.cov()` will produce the correlation or covariance matrix.  Or two Series can be used to get the correlation (or covariance) with `Series1`.corr(`Series2`)

In [36]:
df.corr()

          W         X         Y         Z
W  1.000000 -0.893732 -0.213346  0.816362
X -0.893732  1.000000  0.461376 -0.770773
Y -0.213346  0.461376  1.000000 -0.152616
Z  0.816362 -0.770773 -0.152616  1.000000

In [37]:
df['W'].corr(df['X'])

-0.8937321019389699